Pandas 튜토리얼에 있는 Lessons for new pandas users_06에 대한 내용이다.

`groupby` 함수에 대해서 살펴보자.

In [1]:
# 라이브러리 임포트하기
import pandas as pd

In [2]:
# 데이터셋 만들기
d = {'one' : [1, 1, 1, 1, 1], 'two' : [2, 2, 2, 2, 2], 'letter' : ['a', 'a', 'b', 'b', 'c']}

# 데이터프레임 만들기
df = pd.DataFrame(d)
df

   one  two letter
0    1    2      a
1    1    2      a
2    1    2      b
3    1    2      b
4    1    2      c

In [3]:
# group 객체 만들기
one = df.groupby('letter')

# sum 함수 적용하기
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [5]:
letterone = df.groupby(['letter', 'one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [6]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

그룹화하려는 열을 인덱스로 사용하지 않으려면, 다음과 같이 하면 된다.

In [7]:
letterone = df.groupby(['letter', 'one'], as_index = False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [8]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')